Revit 2026 API

# MEPCurveWidth Property

---

The width of the MEP curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Width { get; }
```
```vb
Public ReadOnly Property Width As Double
	Get
```
```cpp
public:
property double Width {
	double get ();
}
```
```fsharp
member Width : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the MEP curve's shape is not rectangular. |

This property is used to retrieve the width of the MEP curve.

#### Reference

MEPCurve Class

Autodesk.Revit.DB Namespace